// BSLLS:LatinAndCyrillicSymbolInWord-off
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазделительНаКлиенте = ПолучитьРазделительПути();
	ОбновитьПодписиНастроекПрограммПросмотра();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПрограммаПросмотраИзмененийПриИзменении(Элемент)
	ПроверитьПутьКПрограмме();
	ОбновитьПодписиНастроекПрограммПросмотра();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПрограммеНажатие(Элемент)
	Если Объект.ПрограммаПросмотраИзменений = "" Тогда
		Возврат;
	КонецЕсли;
	НастройкиСравнения = НастройкиСравнения();
	ЗаполнитьЗначенияСвойств(НастройкиСравнения, Объект);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОткрытияНастроек", ЭтотОбъект);
	ОткрытьФорму("ВнешняяОбработка.АнализРасширенияПриОбновлении.Форма.НастройкиПрограммСравнения", НастройкиСравнения,
		, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКАнализуИзменений(Команда)
	НастройкиСравнения = НастройкиСравнения();
	ЗаполнитьЗначенияСвойств(НастройкиСравнения, Объект);
	Закрыть(НастройкиСравнения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ЭтотОбъект()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаСервере
Функция НастройкиСравнения()
	Возврат ЭтотОбъект().НастройкиСравнения();
КонецФункции

&НаКлиенте
Процедура ПроверитьПутьКПрограмме()
	ПутьДоПрограммы = ПутьДоПрограммы();
	Если ПутьДоПрограммы = "" Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект[ПутьДоПрограммы]) Тогда
		ПутьПоУмолчанию = ПутьПоУмолчанию();
		Если ФайлСуществует(ПутьПоУмолчанию) Тогда
			Объект[ПутьДоПрограммы] = ПутьПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПутьДоПрограммы()
	Если ЗначениеЗаполнено(Объект.ПрограммаПросмотраИзменений) Тогда
		Возврат "ПутьДо" + Объект.ПрограммаПросмотраИзменений;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПутьПоУмолчанию()   
	// BSLLS:UsingHardcodePath-off
	Если ЭтоKDiff3() Тогда
		Возврат "C:\Program Files\KDiff3\bin\kdiff3.exe";
	ИначеЕсли ЭтоP4Merge() Тогда
		Возврат "C:\Program Files\Perforce\p4merge.exe";
	Иначе
		ВызватьИсключение "Не предусмотренная настройка программы";
	КонецЕсли;
	// BSLLS:UsingHardcodePath-on
КонецФункции

&НаКлиенте
Функция ЭтоKDiff3()
	Возврат Объект.ПрограммаПросмотраИзменений = "KDiff3";
КонецФункции

&НаКлиенте
Функция ЭтоP4Merge()
	Возврат Объект.ПрограммаПросмотраИзменений = "P4Merge";
КонецФункции

&НаКлиенте
Функция ФайлСуществует(ПолноеИмяФайла)
	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат Файл.Существует();
КонецФункции

&НаКлиенте
Процедура ОбновитьПодписиНастроекПрограммПросмотра()
	ПутьДоПрограммы = ПутьДоПрограммы();
	Если ПутьДоПрограммы = "" Или Не ЗначениеЗаполнено(Объект[ПутьДоПрограммы]) Тогда
		ПоказываемыйЭлемент = Элементы.ПутьНеНайден;
		НевидимыйЭлемент = Элементы.ПутьКорректен;
		ПоказываемыйЭлемент.Заголовок = "Путь не указан, выберите программу";
	ИначеЕсли ФайлСуществует(Объект[ПутьДоПрограммы]) Тогда
		ПоказываемыйЭлемент = Элементы.ПутьКорректен;
		НевидимыйЭлемент = Элементы.ПутьНеНайден;
		ПоказываемыйЭлемент.Заголовок = Объект[ПутьДоПрограммы] + ". Файл найден. Нажмите для настройки";
	Иначе
		ПоказываемыйЭлемент = Элементы.ПутьНеНайден;
		НевидимыйЭлемент = Элементы.ПутьКорректен;
		ПоказываемыйЭлемент.Заголовок = Объект[ПутьДоПрограммы] + ". Файл не найден. Нажмите для настройки";
	КонецЕсли;

	ПоказываемыйЭлемент.Видимость = Истина;
	НевидимыйЭлемент.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытияНастроек(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Результат);
		ОбновитьПодписиНастроекПрограммПросмотра();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти