&ИзменениеИКонтроль("ПриСозданииЗадач")
Процедура расш_ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, НомерШага)
 
    //Первая строка
    #Удаление
    //Вторая строка
    #КонецУдаления
    #Вставка
    //Третья строка
    #КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ПриОткрытииЗадач")
Процедура расш_ПриОткрытииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, НомерШага)
 
    //Первая строка
    #Удаление
    //Вторая строка
    #КонецУдаления
    #Вставка
    //Третья строка
    #КонецВставки
    //какой то мусор от внедрения
КонецПроцедуры

