///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет состав программного интерфейса для вызова из кода конфигурации.
//
// Параметры:
//   Настройки - Структура - см. ПодключаемыеКоманды.НастройкиПодключаемыхОтчетовИОбработок.
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.НастроитьВариантыОтчета = Истина;
	Настройки.ОпределитьНастройкиФормы = Истина;
	
	Настройки.ДобавитьКомандыОтчетов = Истина;
	Настройки.Размещение.Добавить(Метаданные.Документы._ДемоРеализацияТоваров);
	Настройки.Размещение.Добавить(Метаданные.Документы._ДемоПоступлениеТоваров);
	Настройки.Размещение.Добавить(Метаданные.Справочники._ДемоМестаХранения);
	
КонецПроцедуры

// Вызывается для добавления команд отчетов.
// См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Команды отчетов, которые требуется задать.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление = НСтр("ru = 'Остатки товаров (из расширения)'");
	Команда.КлючВарианта  = "Основной";
	Команда.ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Ложь);
КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Движения товаров на складах за период.'");
КонецПроцедуры

#КонецОбласти

#КонецЕсли