&ИзменениеИКонтроль ("ТоварыТСД")
Функция Рас_ТоварыТСД(ДанныеЗагрузки, АлкогольнаяПродукция)
	Результат = Новый Массив();
	#Удаление
	ПозицияДанных.Вставить("Количество", ЧтениеXML.ЗначениеАтрибута("Quantity"));
	#КонецУдаления	                                                              
	#Вставка
	Если ЧтениеXML.ЗначениеАтрибута("Quantity") = Неопределено Тогда
		ПозицияДанных.Вставить("Количество", 1);
	КонецЕсли;
	#КонецВставки	
	Если ЧтениеXML.ЗначениеАтрибута("Quantity") = Неопределено Тогда
		ПозицияДанных.Вставить("Количество", 1);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&Вместо ("Тест_НетИзменений")
Процедура Рас_Тест_НетИзменений() Экспорт
	а = 1;
	б = 1;
	в = 1;
КонецПроцедуры

&ИзменениеИКонтроль ("Тест_ИзмененияТолькоВОдномВарианте")
Процедура Тест_ИзмененияТолькоВОдномВарианте()
        а = 1;
        б = 1;
        в = 1;
КонецПроцедуры

&Вместо ("Тест_ИзмененияВРазныхМестах")
Процедура Рас_Тест_ИзмененияВРазныхМестах() Экспорт
        а = 1;
        б = 1;
        в = 2;
КонецПроцедуры

&Вместо ("Тест_ОдинаковыеИзмененияОдноМесто")
Процедура Рас_Тест_ОдинаковыеИзмененияОдноМесто() Экспорт
        а = 1;
        б = 2;
        в = 1;
КонецПроцедуры

&Вместо ("Тест_НепересекающиесяДобавлениеИУдаление")
Процедура Рас_Тест_НепересекающиесяДобавлениеИУдаление() Экспорт
        а = 1;
        б = 1;        
КонецПроцедуры

&Вместо ("Тест_КонфликтОдноМестоРазныеИзменения")
Процедура Рас_Тест_КонфликтОдноМестоРазныеИзменения() Экспорт
        а = 1;
        б = 3;
        в = 1;
КонецПроцедуры

&Вместо ("Тест_КонфликтРазныеВставкиОднаПозиция")
Процедура Рас_Тест_КонфликтРазныеВставкиОднаПозиция() Экспорт
        а = 1;
        а2 = 1;//новая
        б = 1;
        в = 1;
КонецПроцедуры

&Вместо ("Тест_КонфликтУдалениеПротивИзменения")
Процедура Рас_Тест_КонфликтУдалениеПротивИзменения() Экспорт
        а = 1;
        б = 3;
        в = 1;
КонецПроцедуры

&Вместо ("Тест_КонфликтПерекрывающиесяМногострочные")
Процедура Рас_Тест_КонфликтПерекрывающиесяМногострочные() Экспорт
        а = 1;
        б = 2;
        в = 33;
        г = 1;
КонецПроцедуры

&Вместо ("Тест_ОдинаковыеВставкиОднаПозиция")
Процедура Рас_Тест_ОдинаковыеВставкиОднаПозиция() Экспорт
        а = 1;
        б = 1;
        ж = 1;//общая вставка
        в = 1;
КонецПроцедуры

&Вместо ("Тест_ВставкаПослеИзменённойСтроки")
Процедура Рас_Тест_ВставкаПослеИзменённойСтроки() Экспорт
        а = 1;
        б = 2;
        в = 1;
КонецПроцедуры

