&Вместо("ПриСозданииЗадач")
Процедура расш_ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, НомерШага)
 //Код равен 3
КонецПроцедуры

&После("ПриСозданииЗадач")
Процедура расш_ПослеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, НомерШага)
 //Код  после
КонецПроцедуры

&Перед("ПриСозданииЗадач")
Процедура расш_ПередПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, НомерШага)
 //Код перед
КонецПроцедуры


&ИзменениеИКонтроль("ПолучитьДанныеПоШтрихкодам")
Процедура ДопПолучитьДанныеПоШтрихкодам(КэшированныеЗначения, Штрихкоды) Экспорт
	
	ТекДанные.НесколькоЕдиничныхУпаковок      = ?(Выборка.КоличествоЕдиничныхУпаковок > 1, Истина, Ложь);
		ТекДанные.НеизвестныйШтрихкод             = Ложь;
		ТекДанные.ВариантРасчетаЦеныНабора        = Выборка.ВариантРасчетаЦеныНабора; 
		#Вставка
		ТекДанные.Серия     				      = Выборка.Серия;
		#КонецВставки

КонецПроцедуры