Процедура ИсполняемыеСценарии() Экспорт     
     ЮТТесты
	 	.После("ОчиститьДанныеТестов")
    	.ДобавитьКлиентскийТест("ПроверитьКонфликтыВместо") 
		.ДобавитьКлиентскийТест("ПроверитьБезКонфликтовВместо");
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонфликтыВместо() Экспорт   
	Результат = РезультатОткрытияОбработки("ВместоПередПосле конфликт");
	ЮТест.ОжидаетЧто(Результат.количество(), "Количество измененных методов").Равно(3); 
	ЮТест.ОжидаетЧто(Результат).ЛюбойЭлементСодержитСвойствоСоЗначением("Аннотация", "Вместо");
	ЮТест.ОжидаетЧто(Результат).ЛюбойЭлементСодержитСвойствоСоЗначением("Аннотация", "Перед");
	ЮТест.ОжидаетЧто(Результат).ЛюбойЭлементСодержитСвойствоСоЗначением("Аннотация", "После");
	ЮТест.ОжидаетЧто(Результат).КаждыйЭлементСодержитСвойствоСоЗначением("РезультатСравненияМетодов", "Отличаются тексты методов");
КонецПроцедуры  

&НаКлиенте
Процедура ПроверитьБезКонфликтовВместо() Экспорт   
	Результат = РезультатОткрытияОбработки("ВместоПередПосле без конфликтов");
	ЮТест.ОжидаетЧто(Результат.количество(), "Количество измененных методов").Равно(3);
	ЮТест.ОжидаетЧто(Результат).ЛюбойЭлементСодержитСвойствоСоЗначением("Аннотация", "Вместо");
	ЮТест.ОжидаетЧто(Результат).ЛюбойЭлементСодержитСвойствоСоЗначением("Аннотация", "Перед");
	ЮТест.ОжидаетЧто(Результат).ЛюбойЭлементСодержитСвойствоСоЗначением("Аннотация", "После"); 
	ЮТест.ОжидаетЧто(Результат).КаждыйЭлементСодержитСвойствоСоЗначением("РезультатСравненияМетодов", "");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеТестов() Экспорт   
	ПутьКОбработке = ПутьКОбработке();
 	ВременныйКаталог = ПутьКОбработке + "\tmp\";
    УдалитьФайлы(ВременныйКаталог, "*.*");
КонецПроцедуры

&НаКлиенте
Функция РезультатОткрытияОбработки(ПутьКТестам) Экспорт
		
		ПараметрыВызоваТест = Новый Структура;
		ПараметрыВызоваТест.Вставить("Объект", ПараметрыОбъектаПоУмолчанию());
		ПараметрыВызоваТест.Вставить("ЭтотОбъект", ПараметрыФормы(ПутьКТестам));
		
		ПараметрыОткрытия = Новый Структура; 
		ПараметрыОткрытия.Вставить("ПараметрыВызоваТест", ПараметрыВызоваТест);
		ПараметрыОткрытия.Вставить("ЗапуститьАнализПриОткрытии", Истина);  
		ПараметрыОткрытия.Вставить("ИспользоватьМодальныйРежим", Истина);  
				
		
        АдресХранилища = "";
		Результат = ПоместитьФайл(АдресХранилища, ПутьКОбработке() + "CfeUpdater.epf", , Ложь);           
		ИмяОбработки = ОМ_СлужебныйВызовСервера.ПодключитьВнешнююОбработку(АдресХранилища);
		Результат = ОткрытьФормуМодально("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыОткрытия);  
//		Результат = ОткрытьФормуМодально("Обработка.АнализРасширенияПриОбновлении.Форма.Форма", ПараметрыОткрытия);  
		Возврат Результат;				
	
КонецФункции

Функция ПараметрыФормы(ПутьКТестам)    
	Результат = Новый Структура;       
	ПутьКОбработке = ПутьКОбработке();
 	ПутьКТестам  = ПутьКОбработке + "Tests\" + ПутьКТестам + "\";  
	ВременныйКаталог = ПутьКОбработке + "\tmp\";
	СоздатьКаталог(ВременныйКаталог); 
	Результат.Вставить("ФайлыНовойКонфигурации", ПутьКТестам + "Новая конфигурация\");
	Результат.Вставить("ФайлыОбновляемойКонфигурации", ПутьКТестам + "Старая конфигурация\");
	Результат.Вставить("ФайлыРасширения", ПутьКТестам + "Расширение\");
	Результат.Вставить("КаталогСРезультатами", ВременныйКаталог);   
	Результат.Вставить("ЗапуститьАнализПриОткрытии", Истина);
	Возврат Результат;	
КонецФункции

Функция ПараметрыОбъектаПоУмолчанию()  
	Результат = Новый Структура;
	Результат.Вставить("ПрограммаПросмотраИзменений", "KDiff3");
	Результат.Вставить("ПутьКGitMerge", "C:\Program Files\Git\bin\git.exe");
	Результат.Вставить("ПутьДоKDiff3", "C:\Program Files\KDiff3\bin\kdiff3.exe");
	Результат.Вставить("ПутьДоP4Merge", "C:\Program Files\Perforce\p4merge.exe");
	Результат.Вставить("ПараметрыКоманднойСтроки2ФайлаKDiff3", 
		"[СтараяКонфигурация] [Расширение]  --L1 [ЗаголовокСтарая] --L2 [ЗаголовокРасширение]");
	Результат.Вставить("ПараметрыКоманднойСтроки2ФайлаP4Merge", 
		"-C utf8-bom -dw -nl [ЗаголовокСтарая] -nr [ЗаголовокРасширение]  [СтараяКонфигурация] [Расширение]");
	Результат.Вставить("ПараметрыКоманднойСтроки3ФайлаKDiff3", 
		"[СтараяКонфигурация] [Расширение] [НоваяКонфигурация] -m --L1 [ЗаголовокСтарая] --L2 [ЗаголовокРасширение] --L3 [ЗаголовокНовая]");
	Результат.Вставить("ПараметрыКоманднойСтроки3ФайлаP4Merge", 
		"-C utf8-bom -dw -nb [ЗаголовокСтарая] -nl [ЗаголовокРасширение] -nr [ЗаголовокНовая] [СтараяКонфигурация] [Расширение] [НоваяКонфигурация] ");
	Возврат Результат;	
КонецФункции

Функция ПутьКОбработке()
	Возврат "D:\1C\CfeUpdater\";	
КонецФункции



